package com.jinqu.standardNew.model;

import java.util.List;

/**
 * Created by DELL on 2017/3/24.
 */

public class ModelJDInfo {


    /**
     * Result : true
     * Message : null
     * NodeName : null
     * AllowEditControls : null
     * SignControls : null
     * IsFlowFinished : false
     * IsFinished : false
     * UserID : 496
     * UserName : 周军
     * DepartmentID : 1305
     * DepartmentName : 院部
     * NextAction : 0
     * ChangeAction : 0
     * BackAction : 0
     * FinishAction : 0
     * RejectAction : 0
     * ActionUrl : null
     * ProgressUrl : null
     * StepOrder : 0
     * IsLastStep : false
     * NextSteps : [{"NodeID":134,"NodeType":0,"NodeName":"车辆管理员","ChoosedUsers":null,"Order":2,"ChoosedUserNames":null,"DefaultChoosedUser":0,"Users":[{"ID":496,"Name":"周军","Order":"002_001_00000002"},{"ID":497,"Name":"刘开华","Order":"002_001_00000003"},{"ID":498,"Name":"张德艺","Order":"002_001_00000004"},{"ID":630,"Name":"孙政","Order":"002_002_00000002"},{"ID":631,"Name":"吴江春","Order":"002_002_00000003"},{"ID":632,"Name":"邓豪","Order":"002_002_00000004"},{"ID":633,"Name":"张庆海","Order":"002_002_00000005"},{"ID":634,"Name":"巩埠","Order":"002_002_00000006"},{"ID":635,"Name":"王玉丽","Order":"002_002_00000007"},{"ID":636,"Name":"李纯","Order":"002_002_00000008"},{"ID":637,"Name":"陈强","Order":"002_002_00000009"},{"ID":638,"Name":"钟瑜","Order":"002_002_00000010"},{"ID":639,"Name":"刘会文","Order":"002_002_00000011"},{"ID":640,"Name":"周远林","Order":"002_002_00000012"},{"ID":641,"Name":"杨勇","Order":"002_002_00000013"},{"ID":642,"Name":"莫仕丹","Order":"002_002_00000014"},{"ID":643,"Name":"覃见兵","Order":"002_002_00000015"},{"ID":644,"Name":"喻洪波","Order":"002_002_00000016"},{"ID":645,"Name":"王学明","Order":"002_002_00000017"},{"ID":646,"Name":"刘建明","Order":"002_002_00000018"},{"ID":647,"Name":"赖茹婉","Order":"002_003_00000001"},{"ID":648,"Name":"曹瑛静","Order":"002_003_00000002"},{"ID":649,"Name":"范丹","Order":"002_003_00000003"},{"ID":650,"Name":"叶丹","Order":"002_003_00000004"},{"ID":499,"Name":"孙鹏","Order":"002_004_00000001"},{"ID":500,"Name":"劳绍曙","Order":"002_004_00000002"},{"ID":501,"Name":"陈君","Order":"002_004_00000003"},{"ID":502,"Name":"邓春红","Order":"002_004_00000004"},{"ID":503,"Name":"李娟","Order":"002_004_00000005"},{"ID":504,"Name":"丁颖婷","Order":"002_004_00000006"},{"ID":505,"Name":"陈晓云","Order":"002_004_00000007"},{"ID":506,"Name":"苏燕凤","Order":"002_004_00000008"},{"ID":507,"Name":"杨惠丽","Order":"002_004_00000009"},{"ID":508,"Name":"刘旭","Order":"002_004_00000010"},{"ID":509,"Name":"刘武广","Order":"002_004_00000011"},{"ID":510,"Name":"林俊","Order":"002_004_00000012"},{"ID":511,"Name":"刘颖慧","Order":"002_004_00000013"},{"ID":512,"Name":"唐密","Order":"002_004_00000014"},{"ID":513,"Name":"吴春华","Order":"002_004_00000015"},{"ID":514,"Name":"戴春","Order":"002_004_00000016"},{"ID":515,"Name":"陈永忠","Order":"002_005_00000001"},{"ID":516,"Name":"翁冰怡","Order":"002_005_00000002"},{"ID":517,"Name":"廖伟玲","Order":"002_005_00000003"},{"ID":518,"Name":"关杰","Order":"002_005_00000004"},{"ID":519,"Name":"容样培","Order":"002_005_00000005"},{"ID":520,"Name":"李晓黎","Order":"002_005_00000006"},{"ID":521,"Name":"霍晓艳","Order":"002_005_00000007"},{"ID":522,"Name":"罗城","Order":"002_005_00000008"},{"ID":523,"Name":"杨毅","Order":"002_005_00000009"},{"ID":524,"Name":"贡涛","Order":"002_005_00000010"},{"ID":525,"Name":"郭欢","Order":"002_005_00000011"},{"ID":526,"Name":"王洲","Order":"002_005_00000012"},{"ID":527,"Name":"蒋建军","Order":"002_005_00000013"},{"ID":528,"Name":"赵娜","Order":"002_005_00000014"},{"ID":529,"Name":"陈嘉平","Order":"002_005_00000015"},{"ID":530,"Name":"宋绪双","Order":"002_005_00000016"},{"ID":531,"Name":"张少峰","Order":"002_005_00000017"},{"ID":532,"Name":"黄文峰","Order":"002_005_00000018"},{"ID":533,"Name":"莫小凤","Order":"002_005_00000019"},{"ID":534,"Name":"李健盛","Order":"002_005_00000020"},{"ID":535,"Name":"刘海红","Order":"002_005_00000021"},{"ID":536,"Name":"陈树华","Order":"002_005_00000022"},{"ID":537,"Name":"张晔 ","Order":"002_005_00000023"},{"ID":538,"Name":"张丹妮","Order":"002_005_00000024"},{"ID":539,"Name":"王永强","Order":"002_005_00000025"},{"ID":540,"Name":"张媛","Order":"002_005_00000026"},{"ID":541,"Name":"岳龙飞","Order":"002_005_00000027"},{"ID":542,"Name":"何丰","Order":"002_005_00000028"},{"ID":543,"Name":"张煜航","Order":"002_005_00000029"},{"ID":544,"Name":"付钰","Order":"002_005_00000030"},{"ID":545,"Name":"王佳晶","Order":"002_005_00000031"},{"ID":546,"Name":"谭波","Order":"002_005_00000032"},{"ID":547,"Name":"潘章满","Order":"002_005_00000033"},{"ID":548,"Name":"唐利华","Order":"002_006_00000001"},{"ID":549,"Name":"左罗","Order":"002_006_00000002"},{"ID":550,"Name":"罗倩","Order":"002_006_00000003"},{"ID":551,"Name":"张丽君","Order":"002_006_00000004"},{"ID":552,"Name":"徐静","Order":"002_006_00000005"},{"ID":553,"Name":"秦锋","Order":"002_006_00000006"},{"ID":554,"Name":"姜波","Order":"002_006_00000007"},{"ID":555,"Name":"钟玲","Order":"002_006_00000008"},{"ID":556,"Name":"蔡梅香","Order":"002_006_00000009"},{"ID":557,"Name":"秦满玲","Order":"002_006_00000010"},{"ID":558,"Name":"韩晗","Order":"002_006_00000011"},{"ID":559,"Name":"田辉","Order":"002_006_00000012"},{"ID":560,"Name":"曾阳","Order":"002_006_00000013"},{"ID":561,"Name":"万娉","Order":"002_006_00000014"},{"ID":562,"Name":"刘伟","Order":"002_007_00000001"},{"ID":563,"Name":"钟强","Order":"002_007_00000002"},{"ID":564,"Name":"彭亮","Order":"002_007_00000003"},{"ID":565,"Name":"朱创坤","Order":"002_007_00000004"},{"ID":566,"Name":"蔡欢","Order":"002_007_00000005"},{"ID":567,"Name":"张建辉","Order":"002_007_00000006"},{"ID":568,"Name":"郭璟麒","Order":"002_007_00000007"},{"ID":569,"Name":"罗思傲","Order":"002_007_00000008"},{"ID":570,"Name":"邓婧姝","Order":"002_007_00000009"},{"ID":571,"Name":"杨智","Order":"002_008_00000001"},{"ID":572,"Name":"林鹏","Order":"002_008_00000002"},{"ID":573,"Name":"杨小芳","Order":"002_008_00000003"},{"ID":574,"Name":"吴夕发","Order":"002_008_00000004"},{"ID":575,"Name":"傅永进","Order":"002_008_00000005"},{"ID":576,"Name":"仉靖","Order":"002_008_00000006"},{"ID":577,"Name":"林凯斌","Order":"002_008_00000007"},{"ID":578,"Name":"谢华明","Order":"002_008_00000008"},{"ID":579,"Name":"余利霞","Order":"002_008_00000009"},{"ID":580,"Name":"郑晓霞","Order":"002_008_00000010"},{"ID":581,"Name":"王大江","Order":"002_008_00000011"},{"ID":582,"Name":"张琪","Order":"002_008_00000012"},{"ID":583,"Name":"宋若尘","Order":"002_008_00000013"},{"ID":584,"Name":"蒋勰","Order":"002_008_00000014"},{"ID":585,"Name":"邓剑波","Order":"002_008_00000015"},{"ID":586,"Name":"卜伟","Order":"002_008_00000016"},{"ID":587,"Name":"莫荣晓","Order":"002_008_00000017"},{"ID":588,"Name":"钟智宇","Order":"002_008_00000018"},{"ID":589,"Name":"樊继兴","Order":"002_008_00000019"},{"ID":590,"Name":"孙磊","Order":"002_008_00000020"},{"ID":591,"Name":"李靖靖","Order":"002_008_00000021"},{"ID":592,"Name":"黄碧伟","Order":"002_008_00000022"},{"ID":593,"Name":"杨杰","Order":"002_008_00000023"},{"ID":594,"Name":"方键潮","Order":"002_008_00000024"},{"ID":595,"Name":"黄泓璋","Order":"002_008_00000025"},{"ID":596,"Name":"陈杰超","Order":"002_008_00000026"},{"ID":597,"Name":"欧阳明","Order":"002_008_00000027"},{"ID":598,"Name":"王松","Order":"002_008_00000028"},{"ID":599,"Name":"彭飞","Order":"002_008_00000029"},{"ID":600,"Name":"吴丽红","Order":"002_008_00000030"},{"ID":601,"Name":"郁继要","Order":"002_008_00000031"},{"ID":602,"Name":"商哲","Order":"002_008_00000032"},{"ID":603,"Name":"倪怀宇","Order":"002_008_00000033"},{"ID":604,"Name":"姜宇琦","Order":"002_008_00000034"},{"ID":605,"Name":"孙睿","Order":"002_008_00000035"},{"ID":606,"Name":"李永益","Order":"002_008_00000036"},{"ID":607,"Name":"兰翔","Order":"002_008_00000037"},{"ID":608,"Name":"张杰","Order":"002_008_00000038"},{"ID":609,"Name":"钟俊年","Order":"002_008_00000039"},{"ID":610,"Name":"莫文慰","Order":"002_008_00000040"},{"ID":611,"Name":"冼晓敏","Order":"002_008_00000041"},{"ID":612,"Name":"陈豆","Order":"002_008_00000042"},{"ID":613,"Name":"潘臻钟","Order":"002_008_00000043"},{"ID":614,"Name":"吴伟","Order":"002_008_00000044"},{"ID":615,"Name":"莫非","Order":"002_008_00000045"},{"ID":616,"Name":"邓伟光","Order":"002_009_00000001"},{"ID":617,"Name":"张志勇","Order":"002_010_00000001"},{"ID":618,"Name":"覃晓丽","Order":"002_010_00000002"},{"ID":619,"Name":"马青山","Order":"002_010_00000003"},{"ID":620,"Name":"吴敏慧","Order":"002_010_00000004"},{"ID":621,"Name":"王庆","Order":"002_010_00000005"},{"ID":622,"Name":"赵秀容","Order":"002_010_00000006"},{"ID":623,"Name":"李树雄","Order":"002_010_00000007"},{"ID":624,"Name":"王文莉","Order":"002_010_00000008"},{"ID":625,"Name":"陈飞","Order":"002_010_00000009"},{"ID":626,"Name":"李多闻","Order":"002_010_00000010"},{"ID":627,"Name":"刘学伟","Order":"002_010_00000011"}]}]
     * DefaultChoosedStep : 0
     * DefaultNote : 同意
     * FlowID : 0
     * FlowName : null
     * FlowRefID : 0
     * IsNoteRequired : false
     * Date : 2017-05-11 16:26:23
     * LastNote : null
     * IsNew : false
     * FlowNodeID : 133
     * FlowMultiSignID : 0
     * SignDatas : null
     * AgentEmpName : null
     * IsAllowUndo : false
     */
    public int CreatorEmpId;
    public boolean Result;
    public Object Message;
    public Object NodeName;
    public String AllowEditControls;
    public Object SignControls;
    public boolean IsFlowFinished;
    public boolean IsFinished;
    public int UserID;
    public String UserName;
    public int DepartmentID;
    public String DepartmentName;
    public int NextAction;
    public int ChangeAction;
    public int BackAction;
    public int FinishAction;
    public int RejectAction;
    public Object ActionUrl;
    public Object ProgressUrl;
    public int StepOrder;
    public boolean IsLastStep;
    public int DefaultChoosedStep;
    public String DefaultNote;
    public int FlowID;
    public Object FlowName;
    public int FlowRefID;
    public boolean IsNoteRequired;
    public String Date;
    public Object LastNote;
    public boolean IsNew;
    public int FlowNodeID;
    public int FlowMultiSignID;
    public String SignDatas;
    public Object AgentEmpName;
    public boolean IsAllowUndo;
    public List<NextStepsBean> NextSteps;

    public static class NextStepsBean {
        /**
         * NodeID : 134
         * NodeType : 0
         * NodeName : 车辆管理员
         * ChoosedUsers : null
         * Order : 2
         * ChoosedUserNames : null
         * DefaultChoosedUser : 0
         * Users : [{"ID":496,"Name":"周军","Order":"002_001_00000002"},{"ID":497,"Name":"刘开华","Order":"002_001_00000003"},{"ID":498,"Name":"张德艺","Order":"002_001_00000004"},{"ID":630,"Name":"孙政","Order":"002_002_00000002"},{"ID":631,"Name":"吴江春","Order":"002_002_00000003"},{"ID":632,"Name":"邓豪","Order":"002_002_00000004"},{"ID":633,"Name":"张庆海","Order":"002_002_00000005"},{"ID":634,"Name":"巩埠","Order":"002_002_00000006"},{"ID":635,"Name":"王玉丽","Order":"002_002_00000007"},{"ID":636,"Name":"李纯","Order":"002_002_00000008"},{"ID":637,"Name":"陈强","Order":"002_002_00000009"},{"ID":638,"Name":"钟瑜","Order":"002_002_00000010"},{"ID":639,"Name":"刘会文","Order":"002_002_00000011"},{"ID":640,"Name":"周远林","Order":"002_002_00000012"},{"ID":641,"Name":"杨勇","Order":"002_002_00000013"},{"ID":642,"Name":"莫仕丹","Order":"002_002_00000014"},{"ID":643,"Name":"覃见兵","Order":"002_002_00000015"},{"ID":644,"Name":"喻洪波","Order":"002_002_00000016"},{"ID":645,"Name":"王学明","Order":"002_002_00000017"},{"ID":646,"Name":"刘建明","Order":"002_002_00000018"},{"ID":647,"Name":"赖茹婉","Order":"002_003_00000001"},{"ID":648,"Name":"曹瑛静","Order":"002_003_00000002"},{"ID":649,"Name":"范丹","Order":"002_003_00000003"},{"ID":650,"Name":"叶丹","Order":"002_003_00000004"},{"ID":499,"Name":"孙鹏","Order":"002_004_00000001"},{"ID":500,"Name":"劳绍曙","Order":"002_004_00000002"},{"ID":501,"Name":"陈君","Order":"002_004_00000003"},{"ID":502,"Name":"邓春红","Order":"002_004_00000004"},{"ID":503,"Name":"李娟","Order":"002_004_00000005"},{"ID":504,"Name":"丁颖婷","Order":"002_004_00000006"},{"ID":505,"Name":"陈晓云","Order":"002_004_00000007"},{"ID":506,"Name":"苏燕凤","Order":"002_004_00000008"},{"ID":507,"Name":"杨惠丽","Order":"002_004_00000009"},{"ID":508,"Name":"刘旭","Order":"002_004_00000010"},{"ID":509,"Name":"刘武广","Order":"002_004_00000011"},{"ID":510,"Name":"林俊","Order":"002_004_00000012"},{"ID":511,"Name":"刘颖慧","Order":"002_004_00000013"},{"ID":512,"Name":"唐密","Order":"002_004_00000014"},{"ID":513,"Name":"吴春华","Order":"002_004_00000015"},{"ID":514,"Name":"戴春","Order":"002_004_00000016"},{"ID":515,"Name":"陈永忠","Order":"002_005_00000001"},{"ID":516,"Name":"翁冰怡","Order":"002_005_00000002"},{"ID":517,"Name":"廖伟玲","Order":"002_005_00000003"},{"ID":518,"Name":"关杰","Order":"002_005_00000004"},{"ID":519,"Name":"容样培","Order":"002_005_00000005"},{"ID":520,"Name":"李晓黎","Order":"002_005_00000006"},{"ID":521,"Name":"霍晓艳","Order":"002_005_00000007"},{"ID":522,"Name":"罗城","Order":"002_005_00000008"},{"ID":523,"Name":"杨毅","Order":"002_005_00000009"},{"ID":524,"Name":"贡涛","Order":"002_005_00000010"},{"ID":525,"Name":"郭欢","Order":"002_005_00000011"},{"ID":526,"Name":"王洲","Order":"002_005_00000012"},{"ID":527,"Name":"蒋建军","Order":"002_005_00000013"},{"ID":528,"Name":"赵娜","Order":"002_005_00000014"},{"ID":529,"Name":"陈嘉平","Order":"002_005_00000015"},{"ID":530,"Name":"宋绪双","Order":"002_005_00000016"},{"ID":531,"Name":"张少峰","Order":"002_005_00000017"},{"ID":532,"Name":"黄文峰","Order":"002_005_00000018"},{"ID":533,"Name":"莫小凤","Order":"002_005_00000019"},{"ID":534,"Name":"李健盛","Order":"002_005_00000020"},{"ID":535,"Name":"刘海红","Order":"002_005_00000021"},{"ID":536,"Name":"陈树华","Order":"002_005_00000022"},{"ID":537,"Name":"张晔 ","Order":"002_005_00000023"},{"ID":538,"Name":"张丹妮","Order":"002_005_00000024"},{"ID":539,"Name":"王永强","Order":"002_005_00000025"},{"ID":540,"Name":"张媛","Order":"002_005_00000026"},{"ID":541,"Name":"岳龙飞","Order":"002_005_00000027"},{"ID":542,"Name":"何丰","Order":"002_005_00000028"},{"ID":543,"Name":"张煜航","Order":"002_005_00000029"},{"ID":544,"Name":"付钰","Order":"002_005_00000030"},{"ID":545,"Name":"王佳晶","Order":"002_005_00000031"},{"ID":546,"Name":"谭波","Order":"002_005_00000032"},{"ID":547,"Name":"潘章满","Order":"002_005_00000033"},{"ID":548,"Name":"唐利华","Order":"002_006_00000001"},{"ID":549,"Name":"左罗","Order":"002_006_00000002"},{"ID":550,"Name":"罗倩","Order":"002_006_00000003"},{"ID":551,"Name":"张丽君","Order":"002_006_00000004"},{"ID":552,"Name":"徐静","Order":"002_006_00000005"},{"ID":553,"Name":"秦锋","Order":"002_006_00000006"},{"ID":554,"Name":"姜波","Order":"002_006_00000007"},{"ID":555,"Name":"钟玲","Order":"002_006_00000008"},{"ID":556,"Name":"蔡梅香","Order":"002_006_00000009"},{"ID":557,"Name":"秦满玲","Order":"002_006_00000010"},{"ID":558,"Name":"韩晗","Order":"002_006_00000011"},{"ID":559,"Name":"田辉","Order":"002_006_00000012"},{"ID":560,"Name":"曾阳","Order":"002_006_00000013"},{"ID":561,"Name":"万娉","Order":"002_006_00000014"},{"ID":562,"Name":"刘伟","Order":"002_007_00000001"},{"ID":563,"Name":"钟强","Order":"002_007_00000002"},{"ID":564,"Name":"彭亮","Order":"002_007_00000003"},{"ID":565,"Name":"朱创坤","Order":"002_007_00000004"},{"ID":566,"Name":"蔡欢","Order":"002_007_00000005"},{"ID":567,"Name":"张建辉","Order":"002_007_00000006"},{"ID":568,"Name":"郭璟麒","Order":"002_007_00000007"},{"ID":569,"Name":"罗思傲","Order":"002_007_00000008"},{"ID":570,"Name":"邓婧姝","Order":"002_007_00000009"},{"ID":571,"Name":"杨智","Order":"002_008_00000001"},{"ID":572,"Name":"林鹏","Order":"002_008_00000002"},{"ID":573,"Name":"杨小芳","Order":"002_008_00000003"},{"ID":574,"Name":"吴夕发","Order":"002_008_00000004"},{"ID":575,"Name":"傅永进","Order":"002_008_00000005"},{"ID":576,"Name":"仉靖","Order":"002_008_00000006"},{"ID":577,"Name":"林凯斌","Order":"002_008_00000007"},{"ID":578,"Name":"谢华明","Order":"002_008_00000008"},{"ID":579,"Name":"余利霞","Order":"002_008_00000009"},{"ID":580,"Name":"郑晓霞","Order":"002_008_00000010"},{"ID":581,"Name":"王大江","Order":"002_008_00000011"},{"ID":582,"Name":"张琪","Order":"002_008_00000012"},{"ID":583,"Name":"宋若尘","Order":"002_008_00000013"},{"ID":584,"Name":"蒋勰","Order":"002_008_00000014"},{"ID":585,"Name":"邓剑波","Order":"002_008_00000015"},{"ID":586,"Name":"卜伟","Order":"002_008_00000016"},{"ID":587,"Name":"莫荣晓","Order":"002_008_00000017"},{"ID":588,"Name":"钟智宇","Order":"002_008_00000018"},{"ID":589,"Name":"樊继兴","Order":"002_008_00000019"},{"ID":590,"Name":"孙磊","Order":"002_008_00000020"},{"ID":591,"Name":"李靖靖","Order":"002_008_00000021"},{"ID":592,"Name":"黄碧伟","Order":"002_008_00000022"},{"ID":593,"Name":"杨杰","Order":"002_008_00000023"},{"ID":594,"Name":"方键潮","Order":"002_008_00000024"},{"ID":595,"Name":"黄泓璋","Order":"002_008_00000025"},{"ID":596,"Name":"陈杰超","Order":"002_008_00000026"},{"ID":597,"Name":"欧阳明","Order":"002_008_00000027"},{"ID":598,"Name":"王松","Order":"002_008_00000028"},{"ID":599,"Name":"彭飞","Order":"002_008_00000029"},{"ID":600,"Name":"吴丽红","Order":"002_008_00000030"},{"ID":601,"Name":"郁继要","Order":"002_008_00000031"},{"ID":602,"Name":"商哲","Order":"002_008_00000032"},{"ID":603,"Name":"倪怀宇","Order":"002_008_00000033"},{"ID":604,"Name":"姜宇琦","Order":"002_008_00000034"},{"ID":605,"Name":"孙睿","Order":"002_008_00000035"},{"ID":606,"Name":"李永益","Order":"002_008_00000036"},{"ID":607,"Name":"兰翔","Order":"002_008_00000037"},{"ID":608,"Name":"张杰","Order":"002_008_00000038"},{"ID":609,"Name":"钟俊年","Order":"002_008_00000039"},{"ID":610,"Name":"莫文慰","Order":"002_008_00000040"},{"ID":611,"Name":"冼晓敏","Order":"002_008_00000041"},{"ID":612,"Name":"陈豆","Order":"002_008_00000042"},{"ID":613,"Name":"潘臻钟","Order":"002_008_00000043"},{"ID":614,"Name":"吴伟","Order":"002_008_00000044"},{"ID":615,"Name":"莫非","Order":"002_008_00000045"},{"ID":616,"Name":"邓伟光","Order":"002_009_00000001"},{"ID":617,"Name":"张志勇","Order":"002_010_00000001"},{"ID":618,"Name":"覃晓丽","Order":"002_010_00000002"},{"ID":619,"Name":"马青山","Order":"002_010_00000003"},{"ID":620,"Name":"吴敏慧","Order":"002_010_00000004"},{"ID":621,"Name":"王庆","Order":"002_010_00000005"},{"ID":622,"Name":"赵秀容","Order":"002_010_00000006"},{"ID":623,"Name":"李树雄","Order":"002_010_00000007"},{"ID":624,"Name":"王文莉","Order":"002_010_00000008"},{"ID":625,"Name":"陈飞","Order":"002_010_00000009"},{"ID":626,"Name":"李多闻","Order":"002_010_00000010"},{"ID":627,"Name":"刘学伟","Order":"002_010_00000011"}]
         */

        public int NodeID;
        public int NodeType;
        public String NodeName;
        public String ChoosedUsers;
        public int Order;
        public String ChoosedUserNames;
        public int DefaultChoosedUser;
        public List<UsersBean> Users;

        public static class UsersBean {
            /**
             * ID : 496
             * Name : 周军
             * Order : 002_001_00000002
             */

            public int ID;
            public String Name;
            public String Order;
        }
    }
}
